//
//  GameModel.swift
//  Alias - Swift Maraphon 4
//
//  Created by Artem Solovev on 27.07.2022.
//

import Foundation
import UIKit



// общая структура со свойствами типа, что бы у всех ViewController был доступ к общим данным
struct GameModel {
    
    
    static var wordSets = [
        // Млекопитающие
        ["Жираф", "Пищуха", "Заяц", "Кролик", "Бобр",
         "Мышь", "Тушканчик", "Слепышь", "Хомяк", "Леминг",
         "Крыса", "Белка", "Суслик", "Соня", "Еж",
         "Крот", "Летучая мышь", "Нетопырь", "Кит", "Кашалот",
         "Дельфин", "Морская свинка", "Нарвал", "Белуха", "Олень",
         "Лось", "Бизон", "Овцебык", "Баран", "Козел",
         "Кабан", "Лошадь", "Кот", "Рысь", "Тигр",
         "Леопард", "Каракал", "Гиена", "Сабака", "Волк",
         "Лиса", "Песец", "Медведь", "Сивуч", "Морж",
         "Нерпа", "Тюлень", "Соболь", "Ласка", "Норка",
         "Росомаха", "Барсук", "Выдра", "Енот", "Лань",
         "Косатка", "Дикобраз", "Бурундук", "Лев", "Зебра"],
        // IT
        ["Принимать", "Доступ", "Профиль", "Адаптер", "Добавить",
         "Интернет-адрес", "Команда", "Антивирусные программы", "Приложение", "Кэш",
         "Бит", "Технология беспроводного обмена данными", "Запуск", "Байт", "Браузер",
         "Буфер", "Баг", "Неполадка", "Загрузочный диск", "Резервное копирование",
         "Компакт-диск", "Чистить", "Кликнуть", "Закрыть", "Объём данных",
         "Копировать", "Центральный процессор", "Вырезать", "Данные", "База данных",
         "Отлаживать", "Настройки по умолчанию", "Удалять", "Рабочий стол", "Цифровой",
         "Директория", "Дисковод", "Дисплей", "Скачать", "Драйвер",
         "Электронная почта", "Редактировать", "Файл", "Найти", "Флеш-карта памяти",
         "Дискета", "Дисковод гибких дисков", "Папка", "Шрифт", "Форматировать",
         "Гигабайт", "Видеокарта", "Взломать", "Жёсткий диск", "Точка доступа",
         "Иконка", "Интернет", "Клавиатура", "Цикл", "Материнская плата"],
        // Страны
        ["Индия", "Китай", "Соединённые Штаты Америки", "Индонезия", "Пакистан",
         "Бразилия", "Нигерия", "Бангладеш", "Россия", "Мексика",
         "Япония", "Эфиопия", "Филиппины", "Египет", "Демократическая Республика Конго",
         "Вьетнам", "Иран", "Турция", "Германия", "Таиланд",
         "Франция", "Великобритания", "Танзания", "Южно-Африканская Республика", "Италия",
         "Кения", "Мьянма", "Республика Корея", "Колумбия", "Уганда",
         "Испания", "Судан", "Алжир", "Аргентина", "Ирак",
         "Украина", "Афганистан", "Канада", "Польша", "Марокко",
         "Узбекистан", "Саудовская Аравия", "Ангола", "Малайзия", "Венесуэла",
         "Перу", "КНДР", "Чили", "Казахстан", "Нидерланды",
         "Сомали", "Куба", "Греция", "Чехия", "Португалия",
         "Азербайджан", "Израиль", "Новая Зеландия", "Финляндия", "Исландия"],
        // Черты характера
        ["забывчивый", "активный", "агрессивный", "злой", "высокомерный",
         "странный", "грубоватый", "занятой", "спокойный", "беззаботный",
         "заботливый", "осторожный", "очаровательный", "харизматичный", "неунывающий",
         "неуклюжий", "ребячливый", "хладнокровный", "сострадательный", "уверенный",
         "храбрый", "трусливый", "сумасшедший", "креативный", "жестокий",
         "хитрый", "любопытный", "циничный", "деликатный", "тщеславный",
         "патриотичный", "независимый", "глупый", "мягкий", "щедрый",
         "предвзятый", "нетерпеливый", "верный", "жадный", "честный",
         "рациональный", "романтичный", "честный", "решительный", "оптимистичный",
         "невежественный", "отвратительный", "угрюмый", "преданный", "скучный",
         "застенчивый", "мудрый", "эмоциональный", "эгоцентрик", "серьёзный",
         "юморной", "необычный", "ленивый", "мрачный", "дружелюбный"],
    ]
    static var currentGame = 1
    static var currentRound = 1
    static var nameTeamNumber1 = "Команда 1"
    static var nameTeamNumber2 = "Команда 2"
    static var currentTeam = nameTeamNumber1
    static var currentTheme = wordSets[0]
    static var pointsTeamNumber1 = 0
    static var pointsTeamNumber2 = 0
    static var jokeText = "Здесь должна была быть шутка, но что-то пошло не так 😭"
    static var lengthRound = 60
    static var seconds = lengthRound
    static var wordNumber = 0

    
    static func pointPlus() {
        switch currentTeam {
        case nameTeamNumber1: pointsTeamNumber1 += 1
        case nameTeamNumber2: pointsTeamNumber2 += 1
        default: break
        }
        print("Команда 1 очки = \(pointsTeamNumber1)")
        print("Команда 2 очки = \(pointsTeamNumber2)")
    }
    static func pointMinus() {
        switch currentTeam {
        case nameTeamNumber1 where pointsTeamNumber1 > 0: pointsTeamNumber1 -= 1
        case nameTeamNumber2 where pointsTeamNumber2 > 0: pointsTeamNumber2 -= 1
        default: break
        }
        print("Команда 1 очки = \(pointsTeamNumber1)")
        print("Команда 2 очки = \(pointsTeamNumber2)")
    }
    
    static func timerStart() {
        seconds = 60
        Timer.scheduledTimer(withTimeInterval: 1.0, repeats: true) { timer in
            if seconds > 0 {
                seconds -= 1
            } else {
                timer.invalidate()
            }
        }
    }
    static func whatCurrentTeam(round: Int) {
        if round % 2 == 1 {
            currentTeam = nameTeamNumber1
        } else {
            currentTeam = nameTeamNumber2
        }
    }
    static func changeCurrentRound() {
        if currentGame % 2 != 0 {
            currentRound += 1
        }
    }
    
    static func wordNumberChange() {
        wordNumber = Int.random(in: 0...currentTheme.count)
        if wordNumber < currentTheme.count - 1 {
            wordNumber += 1
        } else {
            wordNumber = 0
        }
    }
    
}
